{   "India":"India, located in South Asia, is renowned for its rich cultural heritage, diverse traditions, and stunning landscapes. From the majestic Himalayas in the north to the serene beaches in the south, India offers a blend of history, spirituality, and vibrant festivals. Its economy is diverse, thriving on agriculture and technology.",
    "Andaman & Nicobar Island" : "Andaman and Nicobar Islands are a union territory of India located in the Bay of Bengal. Known for their pristine beaches, lush forests, and diverse wildlife, these islands offer a unique blend of natural beauty and cultural heritage. Popular attractions include Cellular Jail, Havelock Island, and Radhanagar Beach.",
    "Jammu & Kashmir": "Jammu & Kashmir, located in northern India, is known for its scenic landscapes, including the Himalayas and the serene Dal Lake. The region is culturally diverse with a blend of Hindu, Muslim, and Buddhist influences. Tourism, agriculture, and handicrafts are major contributors to its economy.",
    "Gujarat": "Gujarat, located on the western coast of India, is known for its vibrant culture, historical landmarks, and industrial growth. The state boasts diverse ecosystems, including the Rann of Kutch and Gir Forest, home to Asiatic lions. Industries like textiles, chemicals, and petroleum drive its economy.",
    "Tamil Nadu": "Tamil Nadu, in southern India, is renowned for its Dravidian architecture, classical dance forms like Bharatanatyam, and rich cultural heritage. The state is a hub for automobile manufacturing and IT services. Its temples, scenic hill stations, and coastal beauty make it a major tourist destination.",
    "Andaman & Nicobar Islands": "Located in the Bay of Bengal, the Andaman & Nicobar Islands are an archipelago known for their pristine beaches, clear waters, and diverse marine life. Popular for water sports and eco-tourism, the islands also hold historical significance with sites like Cellular Jail, reflecting colonial history.",
    "Andhra Pradesh": "Andhra Pradesh, situated on the southeastern coast of India, is known for its rich cultural heritage, vibrant festivals, and delicious cuisine. The state boasts historical landmarks like the ancient city of Amaravati and is famous for its flourishing agriculture, particularly rice and aquaculture.",
    "Daman & Diu": "Daman & Diu, a union territory off the southwestern coast of India, is celebrated for its picturesque beaches, Portuguese heritage, and vibrant culture. With charming colonial architecture and lively local markets, it attracts tourists seeking relaxation and adventure in a coastal paradise.",
    "Bihar": "Bihar, located in eastern India, is known for its historical significance and cultural heritage. It is the birthplace of Buddhism and home to ancient universities like Nalanda. Despite challenges, Bihar is rich in resources and has a growing agricultural sector, contributing to its economy.",
    "Lakshadweep": "Lakshadweep, a group of islands in the Arabian Sea, is famous for its stunning coral reefs, pristine beaches, and lush greenery. The islands are a haven for water sports enthusiasts and nature lovers. Tourism plays a vital role in the economy, promoting sustainable practices.",
    "Madhya Pradesh": "Madhya Pradesh, located in central India, is known for its rich history, wildlife, and cultural diversity. Home to UNESCO World Heritage Sites like Khajuraho and Sanchi, it offers a blend of ancient architecture and natural beauty. The state’s economy relies on agriculture, mining, and tourism.",
    "Karnataka": "Karnataka, in southern India, is known for its diverse landscapes, rich heritage, and thriving IT industry in Bengaluru, the Silicon Valley of India. The state boasts historical sites like Hampi and Mysore Palace, alongside lush forests and coffee plantations, making it a popular tourist destination.",
    "Puducherry": "Puducherry, a union territory, blends French colonial history with Indian culture. Its serene beaches, vibrant markets, and Auroville, an experimental township, attract visitors seeking tranquility and spiritual growth. The territory's cuisine, influenced by both French and Indian flavors, adds to its unique charm.",
    "Uttar Pradesh": "Uttar Pradesh, the most populous state in India, is known for its rich cultural heritage and historical significance. Home to the iconic Taj Mahal, the state offers diverse attractions from the holy cities of Varanasi and Mathura to the vibrant traditions of festivals and cuisine.",
    "West Bengal": "West Bengal, located in eastern India, is renowned for its cultural diversity, literature, and artistic heritage. The state is famous for its tea gardens, Durga Puja celebrations, and the bustling city of Kolkata, which serves as a cultural and economic hub in the region.",
    "Odisha": "Odisha, on the eastern coast of India, is known for its ancient temples, rich arts and crafts, and beautiful beaches. The state is home to the famous Jagannath Temple and Konark Sun Temple, both UNESCO World Heritage Sites. Its diverse culture attracts tourists and pilgrims alike.",
    "Chandigarh": "Chandigarh, a union territory and the capital of both Punjab and Haryana, is known for its modern architecture and urban design by Le Corbusier. The city features beautiful gardens, lakes, and well-planned sectors, making it a prominent destination for urban planning and architecture enthusiasts.",
    "Haryana": "Haryana, located in northern India, is known for its agricultural production and vibrant culture. The state is famous for its traditional music, dance, and cuisine. With proximity to the national capital, Delhi, Haryana has seen rapid industrialization and urban development, contributing to its economy.",
    "Himachal Pradesh": "Himachal Pradesh, nestled in the Himalayas, is known for its breathtaking landscapes, adventure tourism, and pleasant climate. Popular hill stations like Shimla and Manali attract tourists year-round. The state’s economy is driven by tourism, agriculture, and hydropower generation, preserving its natural beauty and culture.",
    "Arunachal Pradesh": "Arunachal Pradesh, located in northeastern India, is known for its stunning landscapes, rich biodiversity, and vibrant tribal culture. The state offers opportunities for trekking, exploring wildlife, and experiencing unique traditions. Its strategic location and natural resources contribute to its growing importance in the region.",
    "Nagaland": "Nagaland, in northeastern India, is known for its rich cultural heritage, colorful festivals, and diverse tribes. The Hornbill Festival showcases the state's vibrant traditions and music. With its lush landscapes and unique customs, Nagaland offers visitors a glimpse into the rich tapestry of indigenous life.",
    "Kerala": "Kerala, known as 'God's Own Country,' is famous for its backwaters, lush greenery, and Ayurveda tourism. The state boasts a unique blend of cultures, delicious cuisine, and vibrant festivals. Eco-tourism and hospitality play a vital role in its economy, attracting tourists seeking relaxation and rejuvenation.",
    "Punjab": "Punjab, known for its agricultural abundance and vibrant culture, is often referred to as the 'Granary of India.' The state is famous for its lively Bhangra dance, delicious cuisine, and historical sites like the Golden Temple. Its strong sense of community and hospitality is well-known.",
    "Assam": "Assam, located in northeastern India, is known for its rich biodiversity, tea plantations, and cultural heritage. The state is home to Kaziranga National Park, a UNESCO World Heritage Site, and hosts vibrant festivals like Bihu. Assam's economy relies on agriculture, tourism, and handicrafts.",
    "Tripura": "Tripura, a northeastern state, is known for its lush green landscapes, diverse culture, and historical sites. The state boasts beautiful temples, palaces, and vibrant festivals. Agriculture is a significant part of the economy, along with tourism, which highlights its natural beauty and rich traditions.",
    "Dadra & Nagar Haveli": "Dadra & Nagar Haveli, a union territory, is known for its lush greenery, scenic landscapes, and tribal culture. The territory offers a blend of nature and heritage, with beautiful forests and unique wildlife. Tourism and agriculture contribute to its economy, promoting sustainable development.",
    "Goa": "Goa, located on the western coast of India, is famous for its beautiful beaches, vibrant nightlife, and Portuguese heritage. The state attracts tourists seeking relaxation, adventure, and cultural experiences. Its economy thrives on tourism, with numerous water sports, markets, and unique culinary offerings.",
    "Ladakh": "Ladakh, known for its stunning landscapes and Buddhist monasteries, is a union territory in northern India. The region is famous for its high-altitude desert, adventure tourism, and unique culture. Ladakh's economy relies on tourism, agriculture, and handicrafts, showcasing its rich traditions and natural beauty.",
    "Chhattisgarh": "Chhattisgarh, located in central India, is known for its rich mineral resources, tribal culture, and lush forests. The state boasts beautiful waterfalls, wildlife sanctuaries, and cultural festivals. Its economy is driven by mining, agriculture, and handicrafts, promoting sustainable development and preserving its cultural heritage.",
    "Maharashtra": "Maharashtra, India's most industrialized state, is known for its diverse culture, Bollywood film industry, and rich history. Mumbai, the state capital, serves as the financial hub of India. With beautiful beaches, hill stations, and historical sites, Maharashtra attracts tourists from around the world.",
    "Manipur": "Manipur, located in northeastern India, is known for its rich cultural heritage, classical dance forms, and beautiful landscapes. The state is home to the famous Manipuri dance and Loktak Lake, the largest freshwater lake in India. Agriculture and tourism play significant roles in its economy.",
    "Meghalaya": "Meghalaya, known as the 'Abode of Clouds,' is famous for its stunning landscapes, living root bridges, and diverse culture. The state experiences heavy rainfall, supporting lush forests and unique biodiversity. Tourism, agriculture, and handicrafts contribute to its economy, attracting nature lovers and adventure seekers.",
    "Mizoram": "Mizoram, located in northeastern India, is known for its picturesque hills, vibrant culture, and unique traditions. The state celebrates various festivals and is famous for its bamboo products. Agriculture, particularly shifting cultivation, plays a significant role in its economy, alongside tourism promoting its natural beauty.",
    "Rajasthan": "Rajasthan, the largest state in India, is famous for its royal heritage, palaces, and vibrant culture. The Thar Desert, along with historical sites like Jaipur and Udaipur, attracts tourists seeking cultural experiences. The state’s economy relies on tourism, agriculture, and handicrafts, showcasing its rich traditions.",
    "Sikkim": "Sikkim, a small northeastern state, is known for its stunning landscapes, diverse flora and fauna, and rich cultural heritage. The state offers trekking opportunities, breathtaking views of the Himalayas, and vibrant festivals. Tourism and agriculture are vital to its economy, promoting sustainable practices.",
    "Uttarakhand": "Uttarakhand, known as the 'Land of Gods,' is famous for its scenic landscapes, including the Himalayas and sacred rivers. The state attracts pilgrims to holy sites like Haridwar and Rishikesh. Tourism, agriculture, and hydroelectric power contribute to its economy while preserving its natural beauty.",
    "Jharkhand": "Jharkhand, located in eastern India, is known for its mineral wealth, lush forests, and diverse tribal culture. The state is home to various waterfalls and wildlife sanctuaries, attracting nature lovers. Its economy relies on mining, agriculture, and tourism, promoting sustainable development and cultural preservation.",
    "NCT of Delhi": "The National Capital Territory of Delhi, India's capital, is known for its rich history, diverse culture, and vibrant economy. The city is a hub for politics, commerce, and education, with numerous historical monuments. Tourism, retail, and IT sectors drive its economy, making it a cosmopolitan center.",
    "Telangana": "Telangana, located in southern India, is known for its rich cultural heritage, historic landmarks, and vibrant festivals. The state capital, Hyderabad, is famous for its technology industry and delicious cuisine. Agriculture, particularly pearl and diamond trading, plays a vital role in its economy."
}
